-- member
INSERT INTO member (LOGIN_TYPE, REFRESH_TOKEN, NAME, IMG_URL, ENCODED_PASSWORD, EMAIL,
                    ACCOUNT_NUMBER, MODIFIED_AT, DELETED_AT, CREATED_AT)
VALUES (
        'EMAIL', 'sample_refresh_token', 'John Doe', 'https://example.com/image.jpg', 'encoded_password_example', 'john.doe@example.com',
        NULL, '2024-06-10 12:34:56', NULL, '2024-06-10 12:00:00'
        );

-- facility
INSERT INTO facility (NAME, TYPE, CREATED_AT, MODIFIED_AT) VALUES
    -- essential
    ('무선 인터넷', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('TV', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('주방', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('세탁기', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('건조기', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('헤어드라이기', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('다리미', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('건물 내 무료 주차', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('건물 부지 내 유료 주차', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('에어컨', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('난방', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('업무 전용 공간', 'ESSENTIAL', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),

    -- special_feature
    ('수영장', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('대형 욕조', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('아기 침대', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('헬스장', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('바비큐 그릴', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('아침식사', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('실내 벽난로', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('야외 샤워 시설', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('야외 식사 공간', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('화로', 'SPECIAL_FEATURE', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),

    -- safety
    ('화재경보기', 'SAFETY', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('구급 상자', 'SAFETY', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('소화기', 'SAFETY', '2024-06-10 12:34:56', '2024-06-10 12:34:56'),
    ('일산화탄소 경보기', 'SAFETY', '2024-06-10 12:34:56', '2024-06-10 12:34:56')
    ;
